#include <stdio.h>
int main() {

	float js[6][7] = { {60,50,90,80},{100,60,90,50},{70,58,65,20},{73,56,96,98},{85,99,62,13}};
	int i;
	printf("|번호|   C언어|    자바|  컴구조|     ITA|    총점|    평균|   석차|\n");
	printf("--------------------------------------------------------------------\n");
	for (int i = 0; i < 5; i++) {
		for (int j = 0; j < 4; j++) {
			js[i][4] = js[i][j];
			js[5][i] += js[i][j];
		}
	}
	for (i = 0; i < 5; i++) {
		printf("| %d번|", i + 1);
		for (int j = 0; j < 4; j++) {
			printf("%8.2f|", js[i][j]);
			js[i][5] += js[i][j];
		}
		js[i][6] = 1;
		printf("%8.2f|%8.2f|",js[i][5],js[i][5]/4.0);
		
		
		for (int i = 0; i <= 4; i++) {
			for (int j = 0; j <= 4; j++) {
				if (js[i][4] < js[j][4]) {
					js[i][6]++;
				}
			}
		}
		printf("%6.f |\n", js[i][6]);
		printf("--------------------------------------------------------------------\n");
	
	
	}
	printf("|총점|");
	for (int j = 0; j < 4; j++) {
			printf("%8.2f|", js[5][j]);
	}
	printf("\n--------------------------------------------------------------------\n");
	printf("|평균|");
	for (int j = 0; j < 4; j++) {
		printf("%8.2f|", js[5][j]/5.0);
	}
	printf("\n");
}